MediaBinding.CreateOSD.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <trt:CreateOSD>
    <trt:OSD token="">
     <tt:VideoSourceConfigurationToken></tt:VideoSourceConfigurationToken>
     <tt:Type>Text</tt:Type>
     <tt:Position>
      <tt:Type></tt:Type>
      <tt:Pos x="0.0" y="0.0">
      </tt:Pos>
      <tt:Extension>
      </tt:Extension>
     </tt:Position>
     <tt:TextString IsPersistentText="false">
      <tt:Type></tt:Type>
      <tt:DateFormat></tt:DateFormat>
      <tt:TimeFormat></tt:TimeFormat>
      <tt:FontSize>0</tt:FontSize>
      <tt:FontColor Transparent="0">
       <tt:Color X="0.0" Y="0.0" Z="0.0" Colorspace="http://www.example.com/schema/anyURI">
       </tt:Color>
      </tt:FontColor>
      <tt:BackgroundColor Transparent="0">
       <tt:Color X="0.0" Y="0.0" Z="0.0" Colorspace="http://www.example.com/schema/anyURI">
       </tt:Color>
      </tt:BackgroundColor>
      <tt:PlainText></tt:PlainText>
      <tt:Extension>
      </tt:Extension>
     </tt:TextString>
     <tt:Image>
      <tt:ImgPath>http://www.example.com/schema/anyURI</tt:ImgPath>
      <tt:Extension>
      </tt:Extension>
     </tt:Image>
     <tt:Extension>
     </tt:Extension>
    </trt:OSD>
   </trt:CreateOSD>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
